Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_УчетРабочегоВремениНовый/РЗ_УчетРабочегоВремениНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЗ_УчетРабочегоВремениНовый</name>
  <registerRecords>AccumulationRegister.РЗ_УчетРабочегоВремени</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЗ_ВидыУчетаРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетВремени</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.РЗ_Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Enums/РЗ_ВидыУчетаРабочегоВремени/РЗ_ВидыУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЗ_ВидыУчетаРабочегоВремени</name>
  <enumValues>
    <name>Программирование</name>
  </enumValues>
  <enumValues>
    <name>Языки</name>
  </enumValues>
</mdclass:Enum>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_УчетРабочегоВремениНовый/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ПрочиеОбработчики

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.РЗ_ВидыУчетаРабочегоВремени.Языки") Тогда
		Элементы.УчетВремениЗадача.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.РЗ_ВидыУчетаРабочегоВремени.Программирование") Тогда
		Элементы.УчетВремениЗадача.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры // УправлениеФормой()

#КонецОбласти
